{
    "title": "Scenic Mountain Trail",
    "description": "A beautiful scenic trail through alpine mountains with panoramic views of the valley below. Perfect for a day hike with moderate difficulty.",
    "coverImage": "viewpoint.jpg",
    "trailPath": [
        [-45.817922, 170.432043],
        [-45.822450, 170.442179],
        [-45.821617, 170.443053]
    ],
    "trailImages": [
        {
            "coordinates": [-45.817922, 170.432043],
            "imageName": "trail_start.jpg",
            "notes": "Starting point of the trail with beautiful mountain views"
        },
        {
            "coordinates": [-45.822450, 170.442179],
            "imageName": "viewpoint.jpg",
            "notes": "Scenic viewpoint overlooking the valley. It's common to find people here taking photos of native birds. Some you might see include tūī, with their iridescent feathers and distinctive white throat tufts, or kererū, the plump and often clumsy wood pigeon that makes a loud whooshing sound as it flies. If you're lucky, you might even spot a kākā, a large, playful parrot that sometimes visits in the early morning or late afternoon, calling out in a series of raucous squawks. Beyond the birds, this viewpoint offers a breathtaking panorama of the valley below. Rolling hills covered in dense native bush stretch into the distance, with pockets of farmland and winding rivers weaving through the landscape. On a clear day, you can see as far as the distant mountain ranges, their peaks dusted with snow in the winter months. Visitors often pause here, not just to admire the view, but to soak in the peaceful atmosphere. The rustling leaves, the occasional call of a bellbird, and the gentle breeze all add to the sense of serenity. Some bring binoculars, hoping to catch a glimpse of a rare species, while others simply sit on the wooden benches, enjoying the moment. Whether you're here for photography, birdwatching, or just a quiet escape, this scenic viewpoint never disappoints."
        },
        {
            "coordinates": [-45.821617, 170.443053],
            "imageName": "waterfall.jpg",
            "notes": "Cascading waterfall along the trail"
        }
    ],
    "pointsOfInterest": [
        {
            "coordinates": [-45.819500, 170.437200],
            "imageName": "rock_formation.jpg",
            "notes": "Interesting rock formation just off the main trail"
        },
        {
            "coordinates": [-45.823100, 170.440800],
            "imageName": "historic_marker.jpg",
            "notes": "Historic marker describing the area's mining history"
        }
    ]
} 